{"type":"chinese|korean|asian fusion|thai", "name":"Pho Kim Long", "text":"I would recommend this place to anyone who wants Asian fusion. This restaurant has amazing food and ambiance, one of the best dining experiences you will ever have! It's different from most restaurants, but you are definitely worth trying out if you're a true fan! If you're hungry or thirsty for good Pho with delicious noodles, try Shang Artisan Noodle — it is fantastic!"}
{"type":"chinese|korean|asian fusion|thai", "name":"District One", "text":"The asian food here is best in Las Vegas! Many people love to eat it at least once a month. It's cozy and tasty so don't try that sitting all day or spend too much on the food."}
{"type":"chinese|korean|asian fusion|thai", "name":"Hakkasan Nightclub", "text":"The asian food is amazing. The service is great and the atmosphere is very nice, but I would not recommend this place to anyone who wants authentic Asian cuisine."}
{"type":"vegetarian|vegan|salad", "name":"VegeNation", "text":"This vegetarian place in Vegas is by far the most popular one and as we all know it's hit or miss when you are back on vacation. I would suggest trying this plant based restaurant out! Their menu offers such great options that will please any vegan friend of yours."}
{"type":"vegetarian|vegan|salad", "name":"Nacho Daddy", "text":"The salad is a must try. I love this place! The food is amazing and the service is great too! I recommend you definitely go back for sure! Great atmosphere, friendly staff and delicious drinks!"}
{"type":"vegetarian|vegan|salad", "name":"El Dorado Cantina", "text":"The vegan options are super diverse and the menu is great! The salad is filling, traditional greens cooked perfectly. This vegetarian restaurant on the Strip in LV!"}
{"type":"sushi|japanese", "name":"KINKA IZAKAYA ORIGINAL", "text":"This place is unbelievably delicious. The service and the food are both above average without forgetting anything! Anything with salmon is a must try!"}
{"type":"sushi|japanese", "name":"Sushi House Goyemon", "text":"It's good to see all the different items in various flavors (light, fluffy or not) which worked together well. I haven't been to Japan but everything here has flavor with some sashimi dishes. The service is great and very fast! Recommend it if you are looking for Japanese food."}
{"type":"sushi|japanese", "name":"Sakana", "text":"This place is awesome! Amazing food, great vibe. It's not to die for but like most authentic restaurants when there isn't a wait time, I suggest you go way over the top with my favorites!"}
{"type":"pizza|italian", "name":"Grand Lux Cafe", "text":"I would recommend this place to anyone looking for a great Italian restaurant. The chicken parm is a must try. The lasagna is also a must try. The service is always great and the food is always delicious."}
{"type":"pizza|italian", "name":"Pizza Rock", "text":"I would recommend this restaurant for any occasion. If you're going to Vegas, do yourself a favor and get reservations before your event because there's usually quite the wait in line! The food here is absolutely incredible!"}
{"type":"pizza|italian", "name":"Four Peaks Brewing", "text":"This restaurant is a little small, but it is very busy so you probably have to wait. The meatballs are so tender that you could eat them in your mouth without breaking or taking away from any other pasta dishes on this menu!"}
{"type":"burger", "name":"Rehab Burger Therapy", "text":"This burger is not easy to eat. How can I say this? The doneness of the yams is high, but that didn't stop me from going back for a second and adding fried okra! The bun is soft and the meat cooked perfectly, The fries are good too!"}
{"type":"burger", "name":"Bachi Burger", "text":"I recommend it to anyone who gets a burger. Great location that is definitely not as typical of Burger Bar. The sweet potato fries, extra crispy skins without sacrificing flavor or quantity, smoked honey mustard garlic sauce - awesome!"}
{"type":"burger", "name":"The Old Fashioned", "text":"This restaurant is located right off the strip. This place is pricey but the food and ambience makes up for it. The only thing keeping people from giving 5 stars to are their burgers which are good but nothing special. They have some pretty unique sauces on them as well."}